app/Views/peminjaman/v_pengajuan_masuk.php

$db = \Config\Database::connect();

foreach ($pengajuanmasuk as $key => $value) {
    $buku = $db->table('peminjaman')
        ->join('buku','buku.id_buku = peminjaman.id_buku', 'left')
        ->where('id_anggota', $value['id_anggota'])
        ->where('status_pinjam', 'Diajukan')
        ->get()->getResultArray();
---
SELECT *
FROM `peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `id_anggota` = '2'
AND `status_pinjam` = 'Diajukan'