app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `anggota`
---
   public function TotalAnggota()
   {
     return $this->db->table('anggota')->countAll();

SELECT COUNT(*) AS `numrows` FROM `buku`
---
   public function TotalBuku()
   {
     return $this->db->table('buku')->countAll();

SELECT COUNT(*) AS `numrows` FROM `ebook`
---
   public function TotalEbook()
   {
     return $this->db->table('ebook')->countAll();

SELECT COUNT(*) AS `numrows` FROM `peminjaman`
---
   public function TotalPeminjaman()
   {
     return $this->db->table('peminjaman')->countAll();