app/Models/ModelAuth.php

SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '1234'
---
   public function LoginUser($email, $password)
   {
        return $this->db->table('user')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();