app/Models/ModelAnggota.php

SELECT *
FROM `anggota`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `anggota`.`id_kelas`
WHERE `id_anggota` = '2'
---
  public function ProfileAnggota($id_anggota)
  {
    return $this->db->table('anggota')
    ->join('kelas','kelas.id_kelas = anggota.id_kelas', 'left')
    ->where('id_anggota',$id_anggota)
    ->get()->getRowArray();