app/Models/ModelPeminjaman.php

INSERT INTO `peminjaman` (`no_pinjam`, `tgl_pengajuan`, `id_anggota`, `tgl_pinjam`, `id_buku`, `qty`, `lama_pinjam`, `tgl_harus_kembali`, `status_pinjam`) VALUES ('220230503', '2023-05-03', '2', '2023-05-04', '10', '1', '7', '2023-05-11', 'Diajukan')
---
   public function AddData($data)
   {
        $this->db->table('peminjaman')->insert($data);

SELECT *
FROM `peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`
WHERE `id_anggota` = '2'
AND `status_pinjam` = 'Diajukan'
---
   public function PengajuanBuku($id_anggota)
     {
        return $this->db->table('peminjaman')
        ->join('buku','buku.id_buku = peminjaman.id_buku', 'left')
        ->join('kategori','kategori.id_kategori = buku.id_kategori', 'left')
        ->join('penerbit','penerbit.id_penerbit = buku.id_penerbit', 'left')
        ->join('penulis','penulis.id_penulis = buku.id_penulis', 'left')
        ->join('rak','rak.id_rak = buku.id_rak', 'left')
        ->where('id_anggota', $id_anggota)
        ->where('status_pinjam', 'Diajukan')
        ->get()->getResultArray();

SELECT COUNT(`peminjaman`.`id_anggota`) AS `qty`, `anggota`.`id_anggota`, `anggota`.`nis`, `anggota`.`nama_siswa`, `anggota`.`foto`, `kelas`.`nama_kelas`
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `anggota`.`id_kelas`
WHERE `status_pinjam` = 'Diajukan'
GROUP BY `peminjaman`.`id_anggota`
---
    public function PengajuanMasuk()
    {
       return $this->db->table('peminjaman')
          ->join('anggota','anggota.id_anggota = peminjaman.id_anggota', 'left')
          ->join('kelas','kelas.id_kelas = anggota.id_kelas', 'left')
          ->where('status_pinjam', 'Diajukan')
          ->selectCount('peminjaman.id_anggota', 'qty')
          ->select('anggota.id_anggota,anggota.nis,anggota.nama_siswa,anggota.foto,kelas.nama_kelas')
          ->groupBy('peminjaman.id_anggota')
          ->get()->getResultArray();