app/Models/ModelPengaturan.php

   public function Slider()
   {
     return $this->db->table('slider')
        ->orderBy('id_slider','ASC')
        ->get()->getResultArray();
---
SELECT *
FROM `slider`
ORDER BY `id_slider` ASC