app/Models/ModelBuku.php

    public function AllData()
    {
        return $this->db->table('buku')
        ->join('kategori','kategori.id_kategori = buku.id_kategori', 'left')
        ->join('penerbit','penerbit.id_penerbit = buku.id_penerbit', 'left')
        ->join('penulis','penulis.id_penulis = buku.id_penulis', 'left')
        ->join('rak','rak.id_rak = buku.id_rak', 'left')
        ->orderBy('id_buku','DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`
ORDER BY `id_buku` DESC