app/Views/v_template.php

SELECT *
FROM `web`
WHERE `id_web` = '1'
---
<body class="hold-transition layout-top-nav">
<?php
$db = \Config\Database::connect();
$web = $db->table('web')
  ->where('id_web', '1')
  ->get()->getRowArray();